;;Localization data taken from Long War 2 by Pavonis Interactive;;
;;;;;;;;;;;;;;;;;;;;  ITEM TEMPLATES ;;;;;;;;;;;;;;;;;;;;;;;

[Pistol_CG X2WeaponTemplate]
FriendlyName="高斯手枪"
FriendlyNamePlural="高斯手枪s"
BriefSummary="一把强大的线圈技术手枪，可以击穿敌人的装甲。"
TacticalText="<Bullet/> 线圈武器自动穿透 1 个敌方护甲。\n<Bullet/>手枪可以通过一个动作发射。\n<Bullet/>士兵可以训练多种能力，从而显着增强他们对手枪的使用。\n<Bullet/>手枪在远距离会失去准确性。"
AbilityDescName="手枪"

[AssaultRifle_CG X2WeaponTemplate]
FriendlyName="高斯步枪"
FriendlyNamePlural="高斯步枪"
BriefSummary="一把强大的中距离穿甲线圈武器，可以扮演突击步枪的角色。"
TacticalText="<Bullet/>线圈武器自动穿透（无视）1 个敌方护甲。<br/><Bullet/>在没有特殊训练的情况下，开火主武器会结束士兵的回合。\n<Bullet/>使用从 变种人敌人那里恢复的升级来提升高斯步枪的战术效果。<br/>"
AbilityDescName="突击步枪"

[Cannon_CG X2WeaponTemplate]
FriendlyName="高斯加农炮"
FriendlyNamePlural="高斯加农炮"
BriefSummary="一种重型自动线圈武器，射速很高。"
TacticalText="<Bullet/>线圈武器自动穿透（无视）1 个敌方护甲。<br/><Bullet/>大炮起到小队自动武器的作用，比步枪有更多的弹药和更大的伤害，但携带起来很麻烦。<br/><Bullet/>使用从变种人敌人那里恢复的升级来提升高斯加农炮的战术效果。<br/>"
AbilityDescName="重机枪"

[SniperRifle_CG X2WeaponTemplate]
FriendlyName="高斯长步枪"
FriendlyNamePlural="高斯长步枪"
BriefSummary="一把加长的高斯步枪，可能被我们的神枪手使用。"
TacticalText="<Bullet/>线圈武器自动穿透（无视）1 个敌方护甲。<br/><Bullet/>狙击步枪通常需要两种动作才能射击，而无需特殊训练。\n<Bullet/>它们在近距离时不太准确，但在远处很致命。\n<Bullet/>使用从敌人那里掠夺的升级来提升高斯长步枪的战术效果。"
AbilityDescName="狙击步枪"

[Shotgun_CG X2WeaponTemplate]
FriendlyName="高斯霰弹枪"
FriendlyNamePlural="高斯霰弹枪"
BriefSummary="一种近距离线圈技术武器，填补了霰弹枪的角色。"
TacticalText="<Bullet/>线圈武器自动穿透（无视）1 个敌方护甲。<br/><Bullet/>霰弹枪式武器在近距离非常有效，但在较远的距离内它们的准确性会迅速下降。\n<Bullet/>使用从敌人那里掠夺的升级来提升高斯霰弹枪的战术效果。"
AbilityDescName="霰弹枪"

[SMG_CG X2WeaponTemplate]
FriendlyName="高斯冲锋枪"
FriendlyNamePlural="高斯冲锋枪"
BriefSummary="高斯步枪的轻量级版本，发射的子弹较小，但为用户提供了在战场上更多的机动性。"
TacticalText="<Bullet/>线圈武器自动穿透（无视）1 个敌方护甲。<br/><Bullet/>相对于突击步枪，冲锋枪式武器提供额外的机动性、近距离精度和隐蔽性，但它们造成的伤害更少，弹药更少，并且在远距离会受到精度惩罚。<br/>"
AbilityDescName="冲锋枪"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Techs ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[CoilGunTech_LW X2TechTemplate]
DisplayName="线圈武器"
CodeName="莱尔特斯"
Summary="现在是时候超越对捕获的武器进行逆向工程，开发一种新的磁性武器系列，优于变种人使用的武器。"
LongDescription="线圈型磁性武器的原理早已为人所知，但需要我们对外星材料和能源供应的了解才能使之成为现实。而现实情况是，我们开发的武器超过了变种人部队的火力，接近于一些外星武器。我们的线圈武器发射子弹包裹在烧蚀塑料中，当子弹穿过枪管时，它会以比外星人基于轨道炮的系统更高的速度熔化。子弹本身也可以打穿薄薄的护甲。R. 泰根。"


[AdvancedCoilGunTech_LW X2TechTemplate]
DisplayName="高级线圈武器"
CodeName="赤狐"
Summary="我们现在可以将注意力转向开发专门的线圈武器。"
LongDescription="调整我们的新线圈武器设计以适应我们定义的战斗角色的挑战并非无懈可击;线圈本身必须经过精确加工，这样子弹就不会在枪管中丢失，这可能会对枪支和用户产生灾难性后果。这也许可以解释为什么变种人从未采用这种武器风格;它们太昂贵且劳动密集型，不适合全球范围内训练有素的克隆人大军进行工业规模生产。然而，他们非常适合一小群专业士兵。R. 泰根。"

